Repository: dafrito/trac-mirror
Catalog: trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: Path to the Enscript executable.
it: Percorso dell'eseguibile Enscript.

source: List of additional MIME types known by Enscript. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding Enscript mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the Enscript render, which is 2 (''since 0.10'').
it: Lista di tipi MIME addizionali per Enscript. Ciascun tipo deve essere specificato da una tupla `mimetype:modo:qualità` dove `mimetype` è il tipo MIME, `modo` è il corrispondente modo che Enscript deve usare per la conversione e `qualità` è il grado di qualità associato alla conversione. È possibile in questo modo modificare il grado di qualità usato di default dal render di Enscript, che è 2. (''dalla 0.10'')

source: Path to the PHP executable (''since 0.9'').
it: Percorso dell'eseguibile PHP (''dalla 0.9'').

source: List of additional MIME types known by SilverCity. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding SilverCity mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the SilverCity render, which is 3 (''since 0.10'').
it: Lista di tipi MIME addizionali per SilverCity. Ciascun tipo deve essere specificato da una tupla `mimetype:modo:qualità` dove `mimetype` è il tipo MIME, `modo` è il corrispondente modo che SilverCity deve usare per la conversione e `qualità` è il grado di qualità associato alla conversione. È possibile in questo modo modificare il grado di qualità usato di default dal render di SilverCity, che è 3. (''dalla 0.10'')<

source: Location of authz policy configuration file.
it: Posizione del file di configurazione della policy authz.

source: This section provides a way to add arbitrary permissions to a Trac environment. This can be useful for adding new permissions to use for workflow actions, for example. To add new permissions, create a new section `[extra-permissions]` in your `trac.ini`. Every entry in that section defines a meta-permission and a comma-separated list of permissions. For example: {{{ [extra-permissions] extra_admin = extra_view, extra_modify, extra_delete }}} This entry will define three new permissions `EXTRA_VIEW`, `EXTRA_MODIFY` and `EXTRA_DELETE`, as well as a meta-permissions `EXTRA_ADMIN` that grants all three permissions. If you don't want a meta-permission, start the meta-name with an underscore (`_`): {{{ [extra-permissions] _perms = extra_view, extra_modify }}}
it: Questa sezione consente di aggiungere permessi arbitrari a un ambiente Trac. Può essere utile ad esempio per aggiungere dei permessi utilizzabili nelle azioni del flusso di lavoro. Per aggiungere un nuovo permesso, crea una nuova sezione `[extra-permissions]` nel file `trac.ini`. Ogni voce in questa sezione definisce un meta-permesso e una lista di permessi separati da virgole. Ad esempio: {{{ [extra-permissions] extra_admin = extra_view, extra_modify, extra_delete }}} definisce tre nuovi permessi `EXTRA_VIEW`, `EXTRA_MODIFY` e `EXTRA_DELETE`, oltre che al meta-permesso `EXTRA_ADMIN` che include tutti e tre i permessi. Se non desideri avere il meta-permesso, aggiungi un underscore (`_`) all'inizio del nome: {{{ [extra-permissions] _perms = extra_view, extra_modify }}}

source: Require commands to be enclosed in an envelope. Must be empty or contain two characters. For example, if set to "[]", then commands must be in the form of [closes #4].
it: Specifica se i comandi debbano essere delimitati, e come. Deve essere o vuota oppure contenere due caratteri. Ad esempio, se viene impostata a "[]", i comandi dovranno essere nella forma "[closes #4]".

source: Commands that close tickets, as a space-separated list.
it: Comandi che chiudono le segnalazioni, indicate come lista di ID separati da spazi.

source: Commands that add a reference, as a space-separated list. If set to the special value <ALL>, all tickets referenced by the message will get a reference to the changeset.
it: Comandi per aggiungere un riferimento, come lista separata da spazi. Se impostato al valore speciale "<ALL>", tutte le segnalazioni referenziate nel messaggio verranno relazionate al changeset.

source: Check that the committer has permission to perform the requested operations on the referenced tickets. This requires that the user names be the same for Trac and repository operations.
it: Verifica che l'autore del commit abbia il permesso di eseguire l'azione richiesta sulle segnalazioni referenziate. Questo necessita che i nomi utente di Trac e del repository corrispondano.

source: Send ticket change notification when updating a ticket.
it: Invia una notifica di modifica della segnalazione quando viene aggiornata.

source: Enable persistent caching of commit tree.
it: Abilita una cache persistente del contenuto del repository.

source: Wrap `GitRepository` in `CachedRepository`.
it: Accedi al `GitRepository` usando un `CachedRepository`.

source: The length at which a sha1 should be abbreviated to (must be >= 4 and <= 40).
it: La lunghezza a cui troncare i codici sha1 (deve essere >= 4 e <= 40).

source: The minimum length of an hex-string for which auto-detection as sha1 is performed (must be >= 4 and <= 40).
it: La lunghezza minima di una stringa esadecimale perché venga riconosciuta come un codice sha1 (deve essere >= 4 e <= 40).

source: Enable reverse mapping of git email addresses to trac user ids (costly if you have many users).
it: Abilita la mappatura inversa tra gli indirizzi email di git e gli ID degli utenti Trac (onerosa se gli utenti sono tanti).

source: Use git-committer id instead of git-author id for the changeset ''Author'' field.
it: Usa il valore di git-committer invece che di git-author per il campo ''Author'' dei changeset.

source: Use git-committer timestamp instead of git-author timestamp for the changeset ''Timestamp'' field.
it: Usa l'istante specificato da git-committer invece che quello specificato da git-author per il campo ''Timestamp'' dei changeset.

source: Define charset encoding of paths within git repositories.
it: Specifica la codifica dei percorsi dei repository git.

source: Path to the git executable.
it: Percorso dell'eseguibile git.

source: Path to a gitweb-formatted projects.list
it: Percorso del file projects.list nel formato gitweb.

source: Path to the base of your git projects
it: Percorso base dei tuoi repository git.

source: Template for project URLs. %s will be replaced with the repo name
it: Template per gli URL dei progetti. %s verrà sostituito con il nome del repository.

source: Comma separated list of paths categorized as branches. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/trunk, /branches/*, /projectAlpha/trunk, /sandbox/*`
it: Lista dei percorsi classificati come branch, separati da virgole. Se un percorso termina con '*', allora tutte le directory trovate sotto quel percorso verranno incluse. Esempio: `/trunk, /branches/*, /progettoAlfa/trunk, /sandbox/*`

source: Comma separated list of paths categorized as tags. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/tags/*, /projectAlpha/tags/A-1.0, /projectAlpha/tags/A-v1.1`
it: Lista dei percorsi classificati come tag, separati da virgole. Se un percorso termina con '*', allora tutte le directory trovate sotto quel percorso verranno incluse. Esempio: `/tags/*, /progettoAlfa/tags/*, /progettoAlfa/tags/A-v1.1`

source: The TracBrowser for Subversion can interpret the `svn:externals` property of folders. By default, it only turns the URLs into links as Trac can't browse remote repositories. However, if you have another Trac instance (or an other repository browser like [http://www.viewvc.org/ ViewVC]) configured to browse the target repository, then you can instruct Trac which other repository browser to use for which external URL. This mapping is done in the `[svn:externals]` section of the TracIni. Example: {{{ [svn:externals] 1 = svn://server/repos1 http://trac/proj1/browser/$path?rev=$rev 2 = svn://server/repos2 http://trac/proj2/browser/$path?rev=$rev 3 = http://theirserver.org/svn/eng-soft http://ourserver/viewvc/svn/$path/?pathrev=25914 4 = svn://anotherserver.com/tools_repository http://ourserver/tracs/tools/browser/$path?rev=$rev }}} With the above, the `svn://anotherserver.com/tools_repository/tags/1.1/tools` external will be mapped to `http://ourserver/tracs/tools/browser/tags/1.1/tools?rev=` (and `rev` will be set to the appropriate revision number if the external additionally specifies a revision, see the [http://svnbook.red-bean.com/en/1.4/svn.advanced.externals.html SVN Book on externals] for more details). Note that the number used as a key in the above section is purely used as a place holder, as the URLs themselves can't be used as a key due to various limitations in the configuration file parser. Finally, the relative URLs introduced in [http://subversion.apache.org/docs/release-notes/1.5.html#externals Subversion 1.5] are not yet supported. (''since 0.11'')
it: Il TracBrowser per Subversion può interpretare le proprietà `svn:externals` sulle cartelle. Di default, si limita a convertire gli URL in collegamenti, dal momento che Trac non può accedere ai repository remoti. D'altro canto, se hai un altro ambiente Trac (oppure un altro visualizzatore di repository tipo [http://www.viewvc.org/ ViewVC]) configurato per accedere al repository remoto, puoi specificare a Trac quale visualizzatore utilizzare per un certo URL esterno. Questa mappatura viene determinata nella sezione `[svn:externals]` del TracIni. Esempio: {{{ [svn:externals] 1 = svn://server/repos1 http://trac/proj1/browser/$path?rev=$rev 2 = svn://server/repos2 http://trac/proj2/browser/$path?rev=$rev 3 = http://theirserver.org/svn/eng-soft http://ourserver/viewvc/svn/$path/?pathrev=25914 4 = svn://anotherserver.com/tools_repository http://ourserver/tracs/tools/browser/$path?rev=$rev }}} Con questa configurazione, il riferimento esterno `svn://anotherserver.com/tools_repository/tags/1.1/tools` verrà rediretto a `http://ourserver/tracs/tools/browser/tags/1.1/tools?rev=` (e `rev` verrà impostato al numero di revisione del caso se il riferimento esterno specifica una revisione, vedi [http://svnbook.red-bean.com/en/1.4/svn.advanced.externals.html SVN Book on externals] per ulteriori dettagli). Nota che il numero usato come chiave nella sezione qui sopra viene semplicemente ignorato, ed è necessario solo perché per varie limitazioni nel parser del file di configurazione non è possibile usare l'URL stesso come chiave. Infine, gli URL relativi introdotti nella versione [http://subversion.apache.org/docs/release-notes/1.5.html#externals Subversion 1.5] non sono ancora supportati. (''dalla 0.11'')

source: Maximum allowed file size (in bytes) for ticket and wiki attachments.
it: Dimensione massima consentita (in byte) per gli allegati alle segnalazioni e alle pagine wiki.

source: Maximum allowed total size (in bytes) for an attachment list to be downloadable as a `.zip`. Set this to -1 to disable download as `.zip`. (''since 1.0'')
it: Dimensione massima consentita (in byte) della lista di allegati per essere scaricabile come `.zip`. Imposta a -1 per disabilitare lo scaricamento come `.zip`. (''dalla 1.0'')

source: Whether attachments should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to attach a file containing cross-site scripting attacks. For public sites where anonymous users can create attachments it is recommended to leave this option disabled (which is the default).
it: Se i file allegati debbano essere visualizzati nel browser, piuttosto che solo tramite scaricamento. Dal momento che praticamente qualsiasi file può essere interpretato come HTML dal browser, un malintenzionato potrebbe allegare un file contenente uno script che implementa un attacco "cross-site". Per siti pubblici dove utenti anonimi possono allegare un file, si raccomanda di lasciare questa opzione disabilitata (il default).<

source: This section is used to enable or disable components provided by plugins, as well as by Trac itself. The component to enable/disable is specified via the name of the option. Whether its enabled is determined by the option value; setting the value to `enabled` or `on` will enable the component, any other value (typically `disabled` or `off`) will disable the component. The option name is either the fully qualified name of the components or the module/package prefix of the component. The former enables/disables a specific component, while the latter enables/disables any component in the specified package/module. Consider the following configuration snippet: {{{ [components] trac.ticket.report.ReportModule = disabled webadmin.* = enabled }}} The first option tells Trac to disable the [wiki:TracReports report module]. The second option instructs Trac to enable all components in the `webadmin` package. Note that the trailing wildcard is required for module/package matching. To view the list of active components, go to the ''Plugins'' page on ''About Trac'' (requires `CONFIG_VIEW` [wiki:TracPermissions permissions]). See also: TracPlugins
it: Questa sezione è usata per abilitare o disabilitare sia i componenti forniti dai plugin che quelli di Trac stesso. Il componente da abilitare/disabilitare viene specificato dal nome dell'opzione. Il suo valore determina lo stato di attivazione: `enabled` oppure `on` per attivarlo, qualsiasi altro valore (tipicamente `disabled` o `off`) per disabilitarlo. Il nome dell'opzione può essere sia il nome completo del componente piuttosto che il prefisso del modulo/package del componente. La prima forma abilita/disabilita uno specifico componente, mentre la seconda abilita/disabilita qualsiasi componente fornito dal modulo/package specificato. Considera la seguente configurazione: {{{ [components] trac.ticket.report.ReportModule = disabled webadmin.* = enabled }}} La prima opzioni indica a Trac di disabilitare il [wiki:TracReports modulo report]. La seconda opzione invece abilita tutti i componenti del package `webadmin`. Nota come il suffisso `*` sia richiesto per individuare i componenti del modulo/package. Per vedere la lista dei componenti attivi, consulta la sezione ''Moduli aggiuntivi installati'' nella pagina ''Info su Trac'' (richiede il [wiki:TracPermissions permesso] `CONFIG_VIEW`). Vedi anche: TracPlugins

source: Path to the //shared plugins directory//. Plugins in that directory are loaded in addition to those in the directory of the environment `plugins`, with this one taking precedence. (''since 0.11'')
it: Percorso della //directory condivisa dei plugin//. I plugin in questa directory sono caricati in aggiunta a quelli nella directory `plugins` dell'ambiente, che hanno comunque precedenza. (''dalla 0.11'')

source: Reference URL for the Trac deployment. This is the base URL that will be used when producing documents that will be used outside of the web browsing context, like for example when inserting URLs pointing to Trac resources in notification e-mails.
it: URL di riferimento dell'ambiente Trac. Si tratta dell'URL di base che verrà usato nella produzione di documenti usati fuori dall'usuale contesto web, come ad esempio quando vengono inseriti URL che puntano a determinate risorse di Trac nelle notifiche via email.

source: Optionally use `[trac] base_url` for redirects. In some configurations, usually involving running Trac behind a HTTP proxy, Trac can't automatically reconstruct the URL that is used to access it. You may need to use this option to force Trac to use the `base_url` setting also for redirects. This introduces the obvious limitation that this environment will only be usable when accessible from that URL, as redirects are frequently used. ''(since 0.10.5)''
it: Utilizza `[trac] base_url` per le redirezioni. In qualche configurazione, tipicamente quando Trac viene esposto tramite un proxy HTTP, Trac non è in grado di ricostruire automaticamente l'URL usato per accedervi. Potresti dover usare questa opzione per forzare il Trac a usare l'impostazione `base_url` anche per le redirezioni. Questo ovviamente implica che l'ambiente potrà essere usato solo quando vi si accede da quella URL, dal momento che le redirezioni vengono usate di frequente. (''dalla 0.10.5'')

source: Restrict cookies to HTTPS connections. When true, set the `secure` flag on all cookies so that they are only sent to the server on HTTPS connections. Use this if your Trac instance is only accessible through HTTPS. (''since 0.11.2'')
it: Limita i cookie alle connessioni HTTPS. Quando impostato a `true`, abilita la flag `secure` su tutti i cookie in modo tale che vengano spediti al server solo tramite connessioni HTTPS. Usa questa opzione solo quando l'istanza Trac sia accessibile solo tramite HTTPS. (''dalla 0.11.2'')

source: Name of the project.
it: Nome del progetto.

source: Short description of the project.
it: Breve descrizione del progetto.

source: URL of the main project web site, usually the website in which the `base_url` resides. This is used in notification e-mails.
it: URL del sito web del progetto principale, solitamente il sito dove risiede `base_url`. Viene usato nelle notifiche via email.

source: E-Mail address of the project's administrator.
it: Indirizzo email dell'amministratore del progetto.

source: Base URL of a Trac instance where errors in this Trac should be reported. This can be an absolute or relative URL, or '.' to reference this Trac instance. An empty value will disable the reporting buttons. (''since 0.11.3'')
it: URL di base dell'istanza Trac dove riportare gli errori che avvengono in questo Trac. Può essere un URL assoluto o relativo, oppure '.' per riferirsi a questa istanza Trac. Specificare un valore vuoto per disabilitare i pulsanti relativi. (''dalla 0.11.3'')

source: Page footer text (right-aligned).
it: Testo usato come piè di pagina (allineato a destra).

source: URL of the icon of the project.
it: URL dell'icona del progetto.

source: Logging facility to use. Should be one of (`none`, `file`, `stderr`, `syslog`, `winlog`).
it: Tipo di logging utilizzato. Valori consentiti: `none`, `file`, `stderr`, `syslog` o `winlog`.

source: If `log_type` is `file`, this should be a path to the log-file. Relative paths are resolved relative to the `log` directory of the environment.
it: Se `log_type` è `file`, questo deve essere il percorso del file di log. Se il percorso è relativo, viene risolto rispetto alla directory `log` dell'ambiente.

source: Level of verbosity in log. Should be one of (`CRITICAL`, `ERROR`, `WARN`, `INFO`, `DEBUG`).
it: Livello di logging. Valori consentiti: `CRITICAL`, `ERROR`, `WARN`, `INFO` o `DEBUG`.

source: Custom logging format. If nothing is set, the following will be used: Trac[$(module)s] $(levelname)s: $(message)s In addition to regular key names supported by the Python logger library (see http://docs.python.org/library/logging.html), one could use: - $(path)s the path for the current environment - $(basename)s the last path component of the current environment - $(project)s the project name Note the usage of `$(...)s` instead of `%(...)s` as the latter form would be interpreted by the ConfigParser itself. Example: `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s` ''(since 0.10.5)''
it: Personalizzazione del formato di logging. Se non viene impostato, verrà usato il seguente formato: {{{ Trac[$(module)s] $(levelname)s: $(message)s }}} Oltre alle chiavi ordinariamente supportate dalla libreria logging di Python (vedi http://docs.python.org/library/logging.html), possono essere usati anche: $(path)s:: il path dell'ambiente corrente $(basename)s:: l'ultima componente del path dell'ambiente corrente $(project)s:: il nome del progetti Da notare l'utlizzo della forma `$(...)s` al posto di `%(...)s` dal momento che quest'ultima forma verrebbe interpretata immediatamente dal ConfigParser stesso. Esempio: {{{ ($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s }}} (''dalla 0.10.5'')

source: Name of the component implementing `IEmailSender`. This component is used by the notification system to send emails. Trac currently provides `SmtpEmailSender` for connecting to an SMTP server, and `SendmailEmailSender` for running a `sendmail`-compatible executable. (''since 0.12'')
it: Nome del componente che implementa `IEmailSender`. Questo componente viene usato dal sistema di notifiche per inviare i messaggi email. Attualmente Trac fornisce `SmtpEmailSender` per connettersi a un server SMTP e `SendmailEmailSender` per lanciare un eseguibile compatibile con `sendmail`. (''dalla 0.12'')

source: Enable email notification.
it: Abilita la notifica via email.

source: Sender address to use in notification emails.
it: Indirizzo del mittente nelle notifiche via email.

source: Sender name to use in notification emails.
it: Nome del mittente nelle notifiche via email.

source: Use the action author as the sender of notification emails. (''since 1.0'')
it: Usa l'autore dell'azione come mittente nelle notifiche via email. (''dalla 1.0'')

source: Reply-To address to use in notification emails.
it: Indirizzo di risposta nelle notifiche via email.

source: Email address(es) to always send notifications to, addresses can be seen by all recipients (Cc:).
it: Indirizzi email a cui inviare sempre le notifiche via email, che sono visti da tutti i destinatari (Cc:).

source: Email address(es) to always send notifications to, addresses do not appear publicly (Bcc:). (''since 0.10'')
it: Indirizzi email a cui inviare sempre le notifiche via email, non visibili dai destinatari (Bcc:). (''since 0.10'')

source: Default host/domain to append to address that do not specify one.
it: Host/domain da appendere agli indirizzi che non lo specificano.

source: Comma-separated list of domains that should not be considered part of email addresses (for usernames with Kerberos domains).
it: Lista dei domini che non devono essere considerati parte del indirizzo email (per i nomi utente dei domini Kerberos), separati da virgole.

source: Comma-separated list of domains that should be considered as valid for email addresses (such as localdomain).
it: Lista dei domini che devono essere considerati come indirizzi email validi (tipo localdomain), separati da virgole.

source: Specifies the MIME encoding scheme for emails. Valid options are 'base64' for Base64 encoding, 'qp' for Quoted-Printable, and 'none' for no encoding, in which case mails will be sent as 7bit if the content is all ASCII, or 8bit otherwise. (''since 0.10'')
it: Specifica lo schema di codifica MIME per i messaggi email. Le opzioni accettate sono 'base64' per la codifica Base64, 'qp' per Quoted-Printable e 'none' per nessuna codifica, nel qual caso le email saranno spedite come 7bit se il contenuto è completamente ASCII, altrimenti come 8bit. (''dalla 0.10'')

source: Recipients can see email addresses of other CC'ed recipients. If this option is disabled (the default), recipients are put on BCC. (''since 0.10'')
it: I destinatari possono vedere gli indirizzi email degli altri destinatari. Se questa opzione è disabilitata (il default), i destinatari vengono messi nel campo BCC. (''dalla 0.10'')
