Repository: dafrito/trac-mirror
Catalog: trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: Permit email address without a host/domain (i.e. username only). The SMTP server should accept those addresses, and either append a FQDN or use local delivery. (''since 0.10'')
it: Consenti indirizzi email senza un host/domain (cioè, solo nome utente). Il server SMTP dovrà accettare questi indirizzi, aggiungendovi un FQDN oppure usando la spedizione locale. (''dalla 0.10'')

source: Text to prepend to subject line of notification emails. If the setting is not defined, then the [$project_name] prefix. If no prefix is desired, then specifying an empty option will disable it. (''since 0.10.1'')
it: Testo da aggiungere in testa all'oggetto delle notifiche via email. Se non viene definito, verrà usato [$nome_progetto] come prefisso. Se non si desidera alcun prefisso, specificare un valore vuoto. (''dalla 0.10.1'')

source: SMTP server hostname to use for email notifications.
it: Hostname del server SMTP da usare per le notifiche via email.

source: SMTP server port to use for email notification.
it: Numero di porta del server SMTP da usare per le notifiche via email.

source: Username for SMTP server. (''since 0.9'')
it: Username per accedere al server SMTP. (''dalla 0.9'')

source: Password for SMTP server. (''since 0.9'')
it: Password per accedere al server SMTP. (''dalla 0.9'')

source: Use SSL/TLS to send notifications over SMTP. (''since 0.10'')
it: Usa SSL/TLS per spedire le notifiche tramite SMTP. (''since 0.10'')

source: Path to the sendmail executable. The sendmail program must accept the `-i` and `-f` options. (''since 0.12'')
it: Percorso dell'eseguibile sendmail. Il programma sendmail deve accettare le opzioni `-i` e `-f`. (''dalla 0.10'')

source: Name of the component implementing `IPermissionStore`, which is used for managing user and group permissions.
it: Nome del componente che implementa `IPermissionStore`, usato per gestire i permessi degli utenti e dei gruppi.

source: List of components implementing `IPermissionPolicy`, in the order in which they will be applied. These components manage fine-grained access control to Trac resources. Defaults to the DefaultPermissionPolicy (pre-0.11 behavior) and LegacyAttachmentPolicy (map ATTACHMENT_* permissions to realm specific ones)
it: Lista di componenti che implementano `IPermissionPolicy`, nell'ordine in cui verranno applicati. Questi componenti gestiscono il controllo di accesso fine alle risorse di Trac. Impostata di default a DefaultPermissionPolicy (comportamento pre-0.11) e LegacyAttachmentPolicy (mappa i permessi ATTACHMENT_* a quelli specifici per il realm)

source: Database connection [wiki:TracEnvironment#DatabaseConnectionStrings string] for this project
it: Connessione al database. [wiki:TracEnvironment#DatabaseConnectionStrings Stringa] di connessione al database per questo progetto.

source: Database backup location
it: Posizione del backup del database.

source: Timeout value for database connection, in seconds. Use '0' to specify ''no timeout''. ''(Since 0.11)''
it: Valore di timeout per la connessione al database, in secondi. Usare '0' per specificare ''nessun timeout''. (''dalla 0.11'')

source: Show the SQL queries in the Trac log, at DEBUG level. ''(Since 0.11.5)''
it: Mostra le query SQL nel log di Trac, al livello DEBUG. (''dalla 0.11.5'')

source: Location of mysqldump for MySQL database backups
it: Percorso di mysqldump per effettuare i backup dei database MySQL.

source: Location of pg_dump for Postgres database backups
it: Percorso di pg_dump per effettuare i backup dei database PostgreSQL.

source: Paths to sqlite extensions, relative to Trac environment's directory or absolute. (''since 0.12'')
it: Percorsi alle estensioni sqlite, sia relativi alla directory dell'ambiente Trac oppure assoluti. (''dalla 0.12'')

source: Charset to be used when in doubt.
it: Codifica da usare in caso di ambiguità.

source: Displayed tab width in file preview. (''since 0.9'')
it: Larghezza del tab nella visualizzazione dei file. (''dalla 0.9'')

source: Maximum file size for HTML preview. (''since 0.9'')
it: Dimensione massima del file per la visualizzazione HTML. (''dalla 0.9'')

source: List of additional MIME types and keyword mappings. Mappings are comma-separated, and for each MIME type, there's a colon (":") separated list of associated keywords or file extensions. (''since 0.10'')
it: Lista di tipi MIME addizionali e mappature di keyword Le mappature sono separate da virgole e per ciascun tipo MIME viene specificata una lista di parole chiave o di estensioni di file separate dal carattere due punti (`:`). (''dalla 0.10'')

source: List of additional MIME types associated to filename patterns. Mappings are comma-separated, and each mapping consists of a MIME type and a Python regexp used for matching filenames, separated by a colon (":"). (''since 1.0'')
it: Lista di tipi MIME associati a pattern di filename. Le mappature sono separate da virgole, e ciascuna consiste in un tipo MIME e una espressione regolare Python usata per verificare i filename, separati da un carattere due punti (`:`). (''dalla 1.0'')

source: Comma-separated list of MIME types that should be treated as binary data. (''since 0.11.5'')
it: Lista di tipi MIME separati da virgole che devono essere considerati come dati binari. (''dalla 0.11.5'')

source: The default style to use for Pygments syntax highlighting.
it: Stile di default utilizzato da Pygments.

source: List of additional MIME types known by Pygments. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding Pygments mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the Pygments render.
it: Lista di tipi MIME addizionali per Pygments. Ciascun tipo deve essere specificato da una tupla `mimetype:modo:qualità` dove `mimetype` è il tipo MIME, `modo` è il corrispondente modo che Pygments deve usare per la conversione e `qualità` è il grado di qualità associato alla conversione. È possibile in questo modo modificare il grado di qualità usato di default dal render di Pygments.

source: Minimum length of query string allowed when performing a search.
it: Lunghezza massima consentita per la stringa di query quando si effettua una ricerca.

source: Specifies which search filters should be disabled by default on the search page. This will also restrict the filters for the quick search function. The filter names defined by default components are: `wiki`, `ticket`, `milestone` and `changeset`. For plugins, look for their implementation of the ISearchSource interface, in the `get_search_filters()` method, the first member of returned tuple. Once disabled, search filters can still be manually enabled by the user on the search page. (since 0.12)
it: Specifica quali filtri di ricerca debbano essere disabilitati di default sulla pagina di ricerca. Questo limita anche i filtri per la funzione di ricerca veloce. I nomi dei filtri definiti dai componenti di default sono: `wiki`, `ticket`, `milestone` e `changeset`. Per i plugin, controlla la loro implementazione dell'interfaccia ISearchSource, nel metodo `get_search_filters()`, il primo elemento della tupla ritornata. Una volta disabilitati, tali filtri potranno essere comunque riabilitati manualmente dall'utente sulla pagina di ricerca. (''dalla 0.12'')

source: In this section, you can define additional fields for tickets. See TracTicketsCustomFields for more details.
it: In questa sezione possono essere specificati campi addizionali per le segnalazioni. Vedi TracTicketsCustomFields per ulteriori dettagli.

source: Ordered list of workflow controllers to use for ticket actions (''since 0.11'').
it: Lista ordinata dei controlli del flusso di lavoro da usare nelle azioni sulle segnalazioni. (''dalla 0.11'')

source: Make the owner field of tickets use a drop-down menu. Be sure to understand the performance implications before activating this option. See [TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]. Please note that e-mail addresses are '''not''' obfuscated in the resulting drop-down menu, so this option should not be used if e-mail addresses must remain protected. (''since 0.9'')
it: Usa un menu a discesa per il campo `incaricato` delle segnalazioni. Assicurati di comprendere le implicazioni sulle performance prima di attivare questa opzione. Vedi [TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]. Nota che gli indirizzi email '''non''' vengono offuscati nel menu, quindi questa opzione non deve essere usata se gli indirizzi email devono rimanere protetti. (''dalla 0.9'')

source: Default version for newly created tickets.
it: Versione di default da usare alla creazione di una nuova segnalazione.

source: Default type for newly created tickets (''since 0.9'').
it: Tipo di default da usare alla creazione di una nuova segnalazione. (''dalla 0.9'')

source: Default priority for newly created tickets.
it: Priorità di default da usare alla creazione di una nuova segnalazione.

source: Default milestone for newly created tickets.
it: Obiettivo di default da usare alla creazione di una nuova segnalazione.

source: Default component for newly created tickets.
it: Componente di default da usare alla creazione di una nuova segnalazione.

source: Default severity for newly created tickets.
it: Severità di default da usare alla creazione di una nuova segnalazione.

source: Default summary (title) for newly created tickets.
it: Sommario (titolo) di default da usare alla creazione di una nuova segnalazione.

source: Default description for newly created tickets.
it: Descrizione di default da usare alla creazione di una nuova segnalazione.

source: Default keywords for newly created tickets.
it: Parole chiave di default da usare alla creazione di una nuova segnalazione.

source: Default owner for newly created tickets.
it: Incaricato di default da usare alla creazione di una nuova segnalazione.

source: Default cc: list for newly created tickets.
it: CC: di default usato alla creazione di nuove segnalazioni.

source: Default resolution for resolving (closing) tickets (''since 0.11'').
it: Risoluzione di default usata per risolvere (chiudere) le segnalazioni. (''dalla 0.11'')

source: The workflow for tickets is controlled by plugins. By default, there's only a `ConfigurableTicketWorkflow` component in charge. That component allows the workflow to be configured via this section in the `trac.ini` file. See TracWorkflow for more details. (''since 0.11'')
it: Il flusso di lavoro delle segnalazioni è determinato dai plugin. Di default, c'è un solo componente `ConfigurableTicketWorkflow` che si occupa della gestione. Questo componente consente di configurare il flusso di lavoro in questa sezione del file `trac.ini`. Consulta TracWorkflow per ulteriori dettagli. (''dalla 0.11'')

source: Always send notifications to the ticket owner (''since 0.9'').
it: Invia sempre le notifiche all'incaricato della segnalazione. (''dalla 0.9'')

source: Always send notifications to any address in the ''reporter'' field.
it: Invia sempre le notifiche a qualsiasi indirizzo contenuto nel campo ''reporter''.

source: Always send notifications to the person who causes the ticket property change and to any previous updater of that ticket.
it: Invia sempre le notifiche alla persona che causa la modifica di una proprietà della segnalazione e a tutti quelli che hanno modificato la segnalazione precedentemente.

source: A Genshi text template snippet used to get the notification subject. By default, the subject template is `$prefix #$ticket.id: $summary`. `$prefix` being the value of the `smtp_subject_prefix` option. ''(since 0.11)''
it: Un template Genshi usato per creare l'oggetto delle notifiche. Di default il template è `$prefix #$ticket.it: $summary`, dove `$prefix` è il valore impostato per l'opzione `smtp_subject_prefix`. (''dalla 0.11'')

source: Like ticket_subject_template but for batch modifications. By default, the template is `$prefix Batch modify: $tickets_descr`. ''(since 1.0)''
it: Come ticket_subject_template ma per le modifiche batch. Di default il template è `$prefix Batch modify: $tickets_descr`. (''dalla 1.0'')

source: Which width of ambiguous characters (e.g. 'single' or 'double') should be used in the table of notification mail. If 'single', the same width as characters in US-ASCII. This is expected by most users. If 'double', twice the width of US-ASCII characters. This is expected by CJK users. ''(since 0.12.2)''
it: Quale larghezza ('single' oppure 'double') debba essere usata per i caratteri ambigui nelle tabelle inserite nelle notifiche email. Se 'single', viene usata la stessa larghezza dei caratteri US-ASCII, adeguato per la maggior parte degli utenti. Se 'double', viene usata una larghezza doppia rispetto ai caratteri US-ASCII, adeguato per gli utenti CJK. (''dalla 0.12.2'')

source: The default query for authenticated users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.11.2'')
it: La query di default per gli utenti autenticati. La query può essere nella sintassi specificata dal [TracQuery#QueryLanguage query language], oppure una stringa URL di query che comincia con il carattere `?` come utilizzata da `query:` [TracQuery#UsingTracLinks Trac links]. (''dalla 0.11.2'')

source: The default query for anonymous users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.11.2'')
it: La query di default per gli utenti anonimy. La query può essere nella sintassi specificata dal [TracQuery#QueryLanguage query language], oppure una stringa URL di query che comincia con il carattere `?` come utilizzata da `query:` [TracQuery#UsingTracLinks Trac links]. (''dalla 0.11.2'')<

source: Number of tickets displayed per page in ticket queries, by default (''since 0.11'')
it: Numero di segnalazioni per pagina mostrate di default nelle ricerce sulle segnalazioni. (''dalla 0.11'')

source: Number of tickets displayed per page in ticket reports, by default (''since 0.11'')
it: Numero di segnalazioni per pagina mostrate di default nei report. (''dalla 0.11'')

source: Number of tickets displayed in the rss feeds for reports (''since 0.11'')
it: Numero di segnalazioni mostrate nel flusso RSS. (''dalla 0.11'')

source: As the workflow for tickets is now configurable, there can be many ticket states, and simply displaying closed tickets vs. all the others is maybe not appropriate in all cases. This section enables one to easily create ''groups'' of states that will be shown in different colors in the milestone progress bar. Note that the groups can only be based on the ticket //status//, nothing else. In particular, it's not possible to distinguish between different closed tickets based on the //resolution//. Example configuration with three groups, //closed//, //new// and //active// (the default only has closed and active): {{{ # the 'closed' group correspond to the 'closed' tickets closed = closed # .order: sequence number in the progress bar closed.order = 0 # .query_args: optional parameters for the corresponding # query. In this example, the changes from the # default are two additional columns ('created' and # 'modified'), and sorting is done on 'created'. closed.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indicates groups that count for overall # completion percentage closed.overall_completion = true new = new new.order = 1 new.css_class = new new.label = new # Note: one catch-all group for other statuses is allowed active = * active.order = 2 # .css_class: CSS class for this interval active.css_class = open # .label: displayed label for this group active.label = in progress }}} The definition consists in a comma-separated list of accepted status. Also, '*' means any status and could be used to associate all remaining states to one catch-all group. The CSS class can be one of: new (yellow), open (no color) or closed (green). Other styles can easily be added using custom CSS rule: `table.progress td.<class> { background: <color> }` to a [TracInterfaceCustomization#SiteAppearance site/style.css] file for example. (''since 0.11'')
it: Dal momento che i flussi di lavoro per le segnalazioni sono configurabili, ci possono essere molti stati e quindi mostrare semplicemente le segnalazioni chiuse piuttosto che tutte le altre potrebbe non essere appropriato in molti casi. Questa sezione consente di creare dei ''gruppi'' di stati che saranno mostrati in colori diversi nelle barre di progresso della vista obiettivi. Nota che le segnalazioni possono essere raggruppate unicamente in base al loro //stato//, nient'altro. In particolare, non è possibile distinguere le segnalazioni chiuse in base alla //risoluzione//. Esempio di configurazione con tre gruppi, //chiuse//, //nuove// e //attive// (di default ci sono solo closed e active): {{{ # il gruppo 'chiuse' corrisponde alle segnalazioni 'closed' chiuse = closed # .order: ordine di presentazione nella barra di progresso chiuse.order = 0 # .query_args: parametri opzionali per la query corrispondente. # In questo esempio, rispetto al default ci sono due # ulteriori colonne ('created' e 'modified'), e # l'ordinamento viene effettuato su 'created'. chiuse.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indica i gruppi che incidono sulla percentuale # di completamento chiuse.overall_completion = true nuove = new nuove.order = 1 nuove.css_class = new nuove.label = nuove # Nota: è consentito avere un gruppo che includa tutti gli stati # non ancora considerati attive = * attive.order = 2 # .css_class: classe CSS per questo intervallo attive.css_class = open # .label: etichetta per questo gruppo attive.label = in lavorazione }}} La definizione consiste in una lista di stati separati da virgole. Inoltre, '*' indica uno stato qualsiasi e può essere usato per associare i rimanenti stati in un unico gruppo. La classe CSS può essere una delle seguenti: `new` (giallo), `open` (nessun colore) oppure `closed` (green). Ulteriori stili possono essere facilmente aggiunti con delle regole CSS personalizzate: `table.progress td.<class> { background: <color> }` inserite ad esempio nel file [TracInterfaceCustomization#SiteAppearance site/style.css]. (''dalla 0.11'')

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the roadmap views.
it: Nome del componente che implementa `ITicketGroupStatsProvider`, che viene usato per raccogliere le statistiche sui gruppi di segnalazioni per la visualizzazione nelle viste degli obiettivi.

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the milestone views.
it: Nome del componente che implementa `ITicketGroupStatsProvider`, che viene usato per raccogliere le statistiche sui gruppi di segnalazioni per la visualizzazione nelle viste degli obiettivi.

source: Enable the display of all ticket changes in the timeline, not only open / close operations (''since 0.9'').
it: Abilita la visualizzazione di tutte le modifiche alle segnalazioni nella cronologia, non solo le operazioni di apertura / chiusura. (''dalla 0.9'')

source: Enable the display of component of tickets in the timeline (''since 1.1.1'').
it: Abilita la visualizzazione del componente delle segnalazioni nella cronologia. (''dalla 1.1.1'')

source: Don't accept tickets with a too big description. (''since 0.11'').
it: Non accettare segnalazioni con una descrizione troppo grande. (''dalla 0.11'')

source: Don't accept tickets with a too big comment. (''since 0.11.2'')
it: Non accettare segnalazioni con un commento troppo grande. (''dalla 0.11.2'')

source: Which formatter flavor (e.g. 'html' or 'oneliner') should be used when presenting the description for new tickets. If 'oneliner', the [timeline] abbreviated_messages option applies. (''since 0.11'').
it: Quale tipo di formattatore (cioè 'html' o 'oneliner') deve essere utilizzato per mostrare la descrizione delle nuove segnalazioni. Quando è impostato a 'oneliner', viene usata l'opzione [timeline] abbreviated_messages. (''dalla 0.11'')

source: Whether Wiki formatter should respect the new lines present in the Wiki text. If set to 'default', this is equivalent to 'yes' for new environments but keeps the old behavior for upgraded environments (i.e. 'no'). (''since 0.11'').
it: Se il formattatore Wiki debba rispettare gli a-capo presenti nel testo Wiki. Se impostato a 'default', è equivalente a 'yes' per i nuovi ambienti mentre viene mantenuto il comportamento precedente negli ambienti che sono stati aggiornati (cioè 'no'). (''dalla 0.11'')

source: The base query to be used when linkifying values of ticket fields. The query is a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.12'')
it: La query di base usata quando i valori dei campi delle segnalazioni vengono trasformati in collegamenti. La stringa di query deve cominciare con il carattere `?` come utilizzata da `query:` [TracQuery#UsingTracLinks Trac links]. (''dalla 0.12'')

source: Default number of days displayed in the Timeline, in days. (''since 0.9.'')
it: Numero di giorni mostrati di default nella cronologia. (''dalla 0.9'')

source: Maximum number of days (-1 for unlimited) displayable in the Timeline. (''since 0.11'')
it: Numero massimo di giorni (-1 per illimitato) visualizzabile nella cronologia. (''dalla 0.11'')

source: Whether wiki-formatted event messages should be truncated or not. This only affects the default rendering, and can be overriden by specific event providers, see their own documentation. (''Since 0.11'')
it: Se i messaggi di evento di tipo wiki debbano essere troncati oppure no. Questo influisce solo sulla resa di default e può essere modificato da specifici fornitori di eventi, consulta la loro documentazione. (''dalla 0.11'')

source: Comma-separated list of allowed prefixes for repository directories when adding and editing repositories in the repository admin panel. If the list is empty, all repository directories are allowed. (''since 0.12.1'')
it: Lista di prefissi consentiti per le directory dei repository, separati da virgole, quando si aggiunge o si modificano i repository nel pannello di amministrazione. Se la lista è vuota, tutte le directory sono consentite. (''dalla 0.12.1'')

source: One of the alternatives for registering new repositories is to populate the `[repositories]` section of the `trac.ini`. This is especially suited for setting up convenience aliases, short-lived repositories, or during the initial phases of an installation. See [TracRepositoryAdmin#Intrac.ini TracRepositoryAdmin] for details about the format adopted for this section and the rest of that page for the other alternatives. (''since 0.12'')
it: Una delle alternative per registrare nuovi repository è quella di popolare la sezione `[repositories]` del `trac.ini`. Si tratta di un'opzione particolarmente adatta per impostare un adeguato alias, o per repository dalla vita breve, o ancora durante le fasi iniziali di una installazione. Consulta [TracRepositoryAdmin#Intrac.ini TracRepositoryAdmin] per i dettagli sul formato di questa sezione, e il resto della pagina per le altre alternative. (''dalla 0.12'')
