Repository: dafrito/trac-mirror
Catalog: trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: List of URI schemes considered "safe", that will be rendered as external links even if `[wiki] render_unsafe_content` is `false`. (''since 0.11.8'')
it: Lista di schemi URI considerati "sicuri", che verranno resi come collegamenti esterni anche quando `[wiki] render_unsafe_content` è `false`. (''dalla 0.11.8'')

source: This section configures InterTrac prefixes. Options in this section whose name contain a "." define aspects of the InterTrac prefix corresponding to the option name up to the ".". Options whose name don't contain a "." define an alias. The `.url` is mandatory and is used for locating the other Trac. This can be a relative URL in case that Trac environment is located on the same server. The `.title` information is used for providing a useful tooltip when moving the cursor over an InterTrac link. The `.compat` option can be used to activate or disable a ''compatibility'' mode: * If the targeted Trac is running a version below [trac:milestone:0.10 0.10] ([trac:r3526 r3526] to be precise), then it doesn't know how to dispatch an InterTrac link, and it's up to the local Trac to prepare the correct link. Not all links will work that way, but the most common do. This is called the compatibility mode, and is `true` by default. * If you know that the remote Trac knows how to dispatch InterTrac links, you can explicitly disable this compatibility mode and then ''any'' TracLinks can become InterTrac links. Example configuration: {{{ [intertrac] # -- Example of setting up an alias: t = trac # -- Link to an external Trac: trac.title = Edgewall's Trac for Trac trac.url = http://trac.edgewall.org }}}
it: Questa sezione configura i prefissi InterTrac. Le opzioni in questa sezione i cui nomi contengano un "." definiscono particolarità del prefisso InterTrac corrispondente al nome dell'opzione fino al ".". Le opzioni il cui nome non contiene un "." definiscono un alias. La chiave `.url` è obbligatoria e viene usata come posizione dell'altro Trac. Può essere un URL relativo nel caso in cui l'altro Trac si trovi sul medesimo server. La chiave `.title` viene usata per mostrare un tooltip quando il cursore viene spostato sul collegamento InterTrac. La chiave `.compat` può essere usata per abilitare o disabilitare la modalità ''compatibile'': * Se il Trac referenziato è precedente alla versione [trac:milestone:0.10 0.10] ([trac:r3526 r3526] per la precisione), allora non è in grado di gestire il collegamento InterTrac e è compito del Trac locale preparare un collegamento corretto. Non tutti i collegamenti potranno funzionare, ma i più comuni sì. Questa viene chiamata ''modalità compatibile'', ed è attivata di default. * Se sei sicuro che il Trac remoto è in grado di gestire i link InterTrac, puoi disattivare esplicitamente questa modalità per far si che ''qualsiasi'' TracLink possa essere usato come un collegamento InterTrac. Esempio di configurazione: {{{ [intertrac] # -- Esempio di impostazione di un alias: t = trac # -- Collegamento a un Trac esterno: trac.title = Edgewall's Trac for Trac trac.url = http://trac.edgewall.org }}}

source: Every option in the `[interwiki]` section defines one InterWiki prefix. The option name defines the prefix. The option value defines the URL, optionally followed by a description separated from the URL by whitespace. Parametric URLs are supported as well. '''Example:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}
it: Ogni opzione nella sezione `[interwiki]` definisce un prefisso InterWiki. Il nome dell'opzione definisce il prefisso, mentre il suo valore definisce l'URL, opzionalmente seguito da una descrizione separata da una spaziatura dall'URL. Sono supportati anche URL parametrici. '''Esempio:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}

source: Maximum allowed wiki page size in bytes. (''since 0.11.2'')
it: Dimensione massima consentita, in byte, di una pagina wiki. (dalla ''0.11.2'')
